In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv(r"C:\Users\santosh nandam\Downloads\titanic (1).csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis = 'columns', inplace= True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [5]:
target =df.Survived
inputs = df.drop('Survived', axis ='columns')

In [6]:
df['Sex']

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [7]:
df1 = pd.get_dummies(df.Sex).astype(int)
df1.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [8]:
inputs = pd.concat([inputs, df1], axis ='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [9]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [10]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
dtype: int64

In [11]:
df=df.fillna(1)

In [12]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
Fare        0
dtype: int64

In [13]:
inputs.isnull().sum()

Pclass      0
Age       177
Fare        0
female      0
male        0
dtype: int64

In [14]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())

In [15]:
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [16]:
inputs.drop('male', axis = 'columns', inplace = True)

In [34]:
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [36]:
inputs=inputs.rename(columns={"female":"sex"})

In [38]:
inputs

     Pclass        Age     Fare  sex
0         3  22.000000   7.2500    0
1         1  38.000000  71.2833    1
2         3  26.000000   7.9250    1
3         1  35.000000  53.1000    1
4         3  35.000000   8.0500    0
..      ...        ...      ...  ...
886       2  27.000000  13.0000    0
887       1  19.000000  30.0000    1
888       3  29.699118  23.4500    1
889       1  26.000000  30.0000    0
890       3  32.000000   7.7500    0

[891 rows x 4 columns]

In [149]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train,y_test = train_test_split(inputs, target, test_size=0.2,random_state=0)

In [151]:
len(x_train)

712

In [153]:
len(x_test)

179

In [155]:
len(inputs)

891

In [157]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [159]:
model.fit(x_train,y_train)

GaussianNB()

In [161]:
pred = model.predict(x_test)

In [163]:
model.score(x_test, y_test)

0.7821229050279329

In [165]:
from sklearn.metrics import classification_report,confusion_matrix

In [167]:
print(confusion_matrix(y_test,pred))

[[87 23]
 [16 53]]

In [169]:
print(classification_report(y_test,pred))

              precision    recall  f1-score   support

           0       0.84      0.79      0.82       110
           1       0.70      0.77      0.73        69

    accuracy                           0.78       179
   macro avg       0.77      0.78      0.77       179
weighted avg       0.79      0.78      0.78       179